blog/flask-click.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-10-14 Fri 11:48 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Flask Click - @kholidfu</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Kholid Fuadi" />
<link rel="stylesheet" type="text/css" href="../stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Flask Click - @kholidfu</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Flask dan Flask-Click</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Flask dan Flask-Click</h2>
<div class="outline-text-2" id="text-1">
<p>
Semenjak versi 0.11, Flask menyertakan fitur baru yakni <code>click</code>
command line interface. <code>click</code> sendiri merupakan pustaka python
yang dikembangkan oleh pembuat Flask.
</p>

<p>
Dengan fitur ini, membuat <i>custom command</i> di Flask menjadi sangat
mudah.
</p>

<p>
Berikut ini adalah cara penggunaannya:
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #00ffff;">import</span> click

<span style="color: #63b8ff;">@app.cli.command</span>()
<span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">initdb</span>():
    <span style="color: #ffc1c1;">'''Init db.</span>

<span style="color: #ffc1c1;">    '''</span>
    click.echo(<span style="color: #ffc1c1;">'Init the db'</span>)
</pre>
</div>

<p>
Sebelumnya, pastikan <i>path</i> menuju ke aplikasi Flask Anda sudah
terkonfigurasi. Saya <i>prefer</i> dengan menambahkan ke berkas <code>bin/activate</code>:
</p>

<div class="org-src-container">

<pre class="src src-text">export FLASK_APP=$VIRTUAL_ENV/app/__init__.py
export FLASK_DEBUG=1
</pre>
</div>

<p>
Kemudian silakan restart terminal atau ketik perintah <code>source
  ~/.bash_profile</code>, dan jalankan perintah <code>initdb</code> diatas:
</p>

<div class="org-src-container">

<pre class="src src-sh">flask initdb
</pre>
</div>

<p>
Secara default, Flask sudah menyertakan perintah <code>flask run</code> untuk
menjalankan localhost server. Tapi Anda dapat melihat daftar
parameter dengan menggunakan perintah
</p>

<div class="org-src-container">

<pre class="src src-sh">flask --help
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2016-09-01</p>
<p class="author">Author: Kholid Fuadi</p>
<p class="date">Created: 2016-10-14 Fri 11:48</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
